# GetItem Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..GetItem Method
RebarContainer Class See Also
---
Gets the item stored in the RebarContainer at the associated index.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarContainerItem GetItem(
	int itemIndex
)
```

Visual Basic
---
```text
Public Function GetItem ( _
	itemIndex As Integer _
) As RebarContainerItem
```

Visual C++
---
```text
public:
RebarContainerItem^ GetItem(
	int itemIndex
)
```

# ### Parameters
itemIndex
    Type: System..::..Int32 Item index in the Rebar Container
# ### Return Value
Rebar Container Item
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The item index is either less than 0 or graeter than or equal to number of items in this Rebar Container element. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace